WSDL/Producao/PCariacicaES-WSEntrada.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2-b05-. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2-b05-. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://webservices.sil.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://webservices.sil.com/" name="WSEntradaService">
<types>
<xsd:schema>
<xsd:import namespace="http://webservices.sil.com/" schemaLocation="http://servicos.cariacica.es.gov.br:8080/tbw/services/WSEntrada?xsd=1" />
</xsd:schema>
</types>
<message name="consultarAtividades">
<part name="parameters" element="tns:consultarAtividades" />
</message>
<message name="consultarAtividadesResponse">
<part name="parameters" element="tns:consultarAtividadesResponse" />
</message>
<message name="nfdEntrada">
<part name="parameters" element="tns:nfdEntrada" />
</message>
<message name="nfdEntradaResponse">
<part name="parameters" element="tns:nfdEntradaResponse" />
</message>
<portType name="WSEntrada">
<operation name="consultarAtividades">
<input wsam:Action="http://webservices.sil.com/WSEntrada/consultarAtividadesRequest" message="tns:consultarAtividades" />
<output wsam:Action="http://webservices.sil.com/WSEntrada/consultarAtividadesResponse" message="tns:consultarAtividadesResponse" />
</operation>
<operation name="nfdEntrada">
<input wsam:Action="http://webservices.sil.com/WSEntrada/nfdEntradaRequest" message="tns:nfdEntrada" />
<output wsam:Action="http://webservices.sil.com/WSEntrada/nfdEntradaResponse" message="tns:nfdEntradaResponse" />
</operation>
</portType>
<binding name="WSEntradaPortBinding" type="tns:WSEntrada">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document" />
<operation name="consultarAtividades">
<soap:operation soapAction="" />
<input>
<soap:body use="literal" />
</input>
<output>
<soap:body use="literal" />
</output>
</operation>
<operation name="nfdEntrada">
<soap:operation soapAction="" />
<input>
<soap:body use="literal" />
</input>
<output>
<soap:body use="literal" />
</output>
</operation>
</binding>
<service name="WSEntradaService">
<port name="WSEntradaPort" binding="tns:WSEntradaPortBinding">
<soap:address location="http://servicos.cariacica.es.gov.br:8080/tbw/services/WSEntrada" />
</port>
</service>
</definitions>