repository/Exemplo_Emissao.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservices.sil.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:nfdEntrada>
         <!--Optional:-->
         <cpfUsuario>555.555.555-55</cpfUsuario>
         <!--Optional:-->
         <hashSenha>cRDtpNCeBiql5KOQsKVyrA0sAiA=</hashSenha>
         <codigoMunicipio>3</codigoMunicipio>
         <!--Optional:-->
         <nfd><![CDATA[
					
			<tbnfd>
			<nfd>			
			<numeronfd>0</numeronfd>
			<codseriedocumento>8</codseriedocumento>
			<codnaturezaoperacao>511</codnaturezaoperacao>
			<codigocidade>3</codigocidade>
			<inscricaomunicipalemissor>113532</inscricaomunicipalemissor>
			<dataemissao>27/11/2018</dataemissao>
			<razaotomador>SMARapd ltda</razaotomador>
			<nomefantasiatomador> SMARapd </nomefantasiatomador>
			<enderecotomador>Rua Aurora</enderecotomador>
			<cidadetomador>Ribeirao Preto</cidadetomador>
			<estadotomador>SP</estadotomador>
			<paistomador>Brasil</paistomador>
			<fonetomador>21119898</fonetomador>
			<faxtomador/>
			<ceptomador>79010100</ceptomador>
			<bairrotomador>Centro</bairrotomador>
			<emailtomador>teste@smarapd.com.br</emailtomador>
			<cpfcnpjtomador>30669959085741</cpfcnpjtomador>
			<inscricaoestadualtomador/>
			<inscricaomunicipaltomador/>
			<tbfatura>
			<fatura>
			<numfatura>06/2018</numfatura>
			<vencimentofatura>10/06/2018</vencimentofatura>
			<valorfatura>100</valorfatura>
			</fatura>
			<fatura>
			<numfatura>07/2018</numfatura>
			<vencimentofatura>10/07/2018</vencimentofatura>
			<valorfatura>100</valorfatura>
			</fatura>
			<fatura>
			<numfatura>08/2018</numfatura>
			<vencimentofatura>10/08/2018</vencimentofatura>
			<valorfatura>100</valorfatura>
			</fatura>
			</tbfatura>
			<tbservico>
			<servico>
			<quantidade>2</quantidade>
			<unidade>UN</unidade>
			<descricao>Servicos de Criacao de Logomarca</descricao>
			<codatividade>0702</codatividade>
			<valorunitario>150</valorunitario>
			<aliquota>2</aliquota>
			<impostoretido>False</impostoretido>
			</servico>
			<servico>
			<quantidade>1</quantidade>
			<unidade>UN</unidade>
			<descricao>Servicos de Criacao de Logomarca</descricao>
			<codatividade>0702</codatividade>
			<valorunitario>200</valorunitario>
			<aliquota>2</aliquota>
			<impostoretido>False</impostoretido>
			</servico>
			<servico>
			<quantidade>5</quantidade>
			<unidade>UN</unidade>
			<descricao>Servicos de Criacao de Logomarca</descricao>
			<codatividade>0702</codatividade>
			<valorunitario>150</valorunitario>
			<aliquota>2</aliquota>
			<impostoretido>False</impostoretido>
			</servico>
			</tbservico>
			<vlraproximposto>0</vlraproximposto>
			<aliquotaimpostoaprox>0</aliquotaimpostoaprox>
			<fonteimpostoaprox>IBPT</fonteimpostoaprox>
			<observacao>Pedido 3258943</observacao>
			<razaotransportadora/>
			<cpfcnpjtransportadora/>
			<enderecotransportadora/>
			<tipofrete>0</tipofrete>
			<quantidade>0</quantidade>
			<especie/>
			<pesoliquido>0</pesoliquido>
			<pesobruto>0</pesobruto>
			<pis/>
			<cofins/>
			<csll/>
			<irrf/>
			<inss/>
			<descdeducoesconstrucao/>
			<totaldeducoesconstrucao/>
			<tributadonomunicipio>true</tributadonomunicipio>
			<numerort/>
			<codigoseriert/>
			<dataemissaort/>
			</nfd>
			<Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
			<SignedInfo>
			<CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
			<SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
			<Reference URI="">
			<Transforms>
			<Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
			</Transforms>
			<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
			<DigestValue>CB+KLlADv0+p9gwUJZYDyIoPiB8=</DigestValue>
			</Reference>
			</SignedInfo>
			<SignatureValue>Qem78QuGuPueshxgRis7SZTfF86LFv8fXzMTUN9JKqQt9haZDZonbHjW8YCjZ3 JL6WDL6khHNdxB29B8AIk55C5noDF3YCiez5TmJFc98qQWgtXdLUODtHXPwzAIJH4tys50xFgoPLUkQusx 2qh9ZP62C19cTjUOWu8u7AHk+cM=</SignatureValue>
			<KeyInfo>
			<X509Data>
			<X509Certificate>MIIFNzCCBKCgAwIBAgIKN7ufiQAAAAAAEDANBgkqhkiG9w0BAQUFADBQMR UwEwYKCZImiZPyLGQBGRYFbG9jYWwxHzAdBgoJkiaJk/IsZAEZFg9kZXNlbnZvbHZpbWVudG8xFjAUBg NVBAMTDU5PVEFDT05UUk9MQ0EwHhcNMDYwNDA0MTU1MTM1WhcNMDcwNDA0MTYwMTM1WjCBlzELMAkGA1UEBhMCQlIxCzAJBgNVBAgTAk1TMRUwEwYDVQQHEwxDYW1wbyBHcmFuZGUxGTAXBgN VBAoTEEVtcHJlc2EgZGUgVGVzdGUxCzAJBgNVBAsTAlRJMRkwFwYDVQQDExBVc3VhcmlvIGRlIFRlc3R lMSEwHwYJKoZIhvcNAQkBFhJ0ZXN0ZUB0ZXN0ZS5jb20uYnIwgZ8wDQYJKoZIhvcNAQEBBQADgY0AMI GJAoGBALVlKBaY30GHXsfUSmZmdl+atvSC5AwJKRQ3881ZShV0iOS37UI9aGkabZ3ybfIU6TfXnglIvGZqv WOBoJLIx2wUOWz073RVifw3pbJ5bDliqHMqgNc7NXfSS1i6DTfrz53DA/yuIak23w+bjlb1cTxw6ACy4uoitcR W0944nOPfAgMBAAGjggLOMIICyjAOBgNVHQ8BAf8EBAMCBsAwHQYDVR0OBBYEFDPijz6ygXfE3a9QG tIlxdupb7N8MBMGA1UdJQQMMAoGCCsGAQUFBwMCMB8GA1UdIwQYMBaAFCDppJYB+Hmg/y0/6jd1fY XcMpNnMIIBIQYDVR0fBIIBGDCCARQwggEQoIIBDKCCAQiGgcBsZGFwOi8vL0NOPU5PVEFDT05UUk9M Q0EsQ049c2VydmVyY3BkLENOPUNEUCxDTj1QdWJsaWMlMjBLZXklMjBTZXJ2aWNlcyxDTj1TZXJ2aWNl cyxDTj1Db25maWd1cmF0aW9uLERDPWRlc2Vudm9sdmltZW50byxEQz1sb2NhbD9jZXJ0aWZpY2F0ZVJld m9jYXRpb25MaXN0P2Jhc2U/b2JqZWN0Q2xhc3M9Y1JMRGlzdHJpYnV0aW9uUG9pbnSGQ2h0dHA6Ly9z ZXJ2ZXJjcGQuZGVzZW52b2x2aW1lbnRvLmxvY2FsL0NlcnRFbnJvbGwvTk9UQUNPTlRST0xDQS5jcmww ggE8BggrBgEFBQcBAQSCAS4wggEqMIG2BggrBgEFBQcwAoaBqWxkYXA6Ly8vQ049Tk9UQUNPTlRST0 xDQSxDTj1BSUEsQ049UHVibGljJTIwS2V5JTIwU2VydmljZXMsQ049U2VydmljZXMsQ049Q29uZmlndXJhd GlvbixEQz1kZXNlbnZvbHZpbWVudG8sREM9bG9jYWw/Y0FDZXJ0aWZpY2F0ZT9iYXNlP29iamVjdENsYX NzPWNlcnRpZmljYXRpb25BdXRob3JpdHkwbwYIKwYBBQUHMAKGY2h0dHA6Ly9zZXJ2ZXJjcGQuZGVzZ W52b2x2aW1lbnRvLmxvY2FsL0NlcnRFbnJvbGwvc2VydmVyY3BkLmRlc2Vudm9sdmltZW50by5sb2NhbF9 OT1RBQ09OVFJPTENBLmNydDANBgkqhkiG9w0BAQUFAAOBgQAEwiMeC2OkseEp7HkZnKRLD8SrUBL 4tEoG0QnyNi4nYD59idIOGiDjBLZEqDqfikR9VVLZS8Z0XqFd1EM633HnaembO08Z7pbyX3OuhkRXOidsjIe Cljv9zPecMVyrDFQ12iyTqxr1T2vs/WRlVO/GI3AH7D8OhIVGdEmCb7e8qw==</X509Certificate>
			</X509Data>
			</KeyInfo>
			</Signature>
			</tbnfd>			
         ]]></nfd>
      </web:nfdEntrada>
   </soapenv:Body>
</soapenv:Envelope>